## 构建和初始化Series

In [1]:
import pandas as pd
import numpy as np

#### Series是一个一维结构,可以通过列表构建

In [3]:
s = pd.Series([6, 'Beijing', 'Hello World'])
s

0              6
1        Beijing
2    Hello World
dtype: object

#### Series默认从0到n作为索引，但是也可以人为指定

In [5]:
s = pd.Series([6, 'Beijing', 'Hello World'], index = ['A', 'B', 'C'])
s

A              6
B        Beijing
C    Hello World
dtype: object

#### Series也可以通过字典构建

In [8]:
cities = {'Beijing':2000, 'Hangzhou':3000, 'Guangzhou':4000, 'Shenzhen':5000}
apts = pd.Series(cities)
print(apts)
print(type(apts))

Beijing      2000
Guangzhou    4000
Hangzhou     3000
Shenzhen     5000
dtype: int64
<class 'pandas.core.series.Series'>

## 选择数据

#### 通过之前创建的index

In [10]:
apts['Guangzhou']

4000

In [11]:
apts[['Guangzhou', 'Beijing']]

Guangzhou    4000
Beijing      2000
dtype: int64

#### 同样可以使用numpy中的布尔类型索引

In [13]:
apts[apts < 4000]

Beijing     2000
Hangzhou    3000
dtype: int64

In [15]:
apts[[True, True, True, False]]

Beijing      2000
Guangzhou    4000
Hangzhou     3000
dtype: int64

## 元素赋值

In [16]:
print('old value',apts['Shenzhen'])

old value 5000

In [17]:
apts['Shenzhen'] = 6000

In [18]:
apts['Shenzhen']

6000

##  数据运算

#### 运算是对所有数值进行的

In [19]:
apts/2

Beijing      1000.0
Guangzhou    2000.0
Hangzhou     1500.0
Shenzhen     3000.0
dtype: float64

In [20]:
apts*2

Beijing       4000
Guangzhou     8000
Hangzhou      6000
Shenzhen     12000
dtype: int64

#### 对两个Series做加法

In [22]:
cars = pd.Series({'Beijing':2000, 'Wuhan':3000, 'Zhengzhou':4000, 'Hangzhou':5000,
                'Guangzhou':6000, 'Shanghai':7000})

In [23]:
print(cars + apts)

Beijing       4000.0
Guangzhou    10000.0
Hangzhou      8000.0
Shanghai         NaN
Shenzhen         NaN
Wuhan            NaN
Zhengzhou        NaN
dtype: float64

#### 数据缺失

In [24]:
'Hangzhou' in apts

True

In [25]:
"Hangzhou" in cars

True

In [26]:
'Wuhan' in apts

False

In [29]:
apts.isnull()

Beijing      False
Guangzhou    False
Hangzhou     False
Shenzhen     False
dtype: bool

In [30]:
apts.notnull()

Beijing      True
Guangzhou    True
Hangzhou     True
Shenzhen     True
dtype: bool

#### 这种方法可以用于作为布尔索引找到对应的缺失值或者非缺失值

## 数据结构DataFrame

#### 创建一个DataFrame

In [33]:
data = {'city': ['Beijing', 'Shanghai', 'Guangzhou', 'Shenzhen', 'Hangzhou', 'Chongqing'],
       'year': [2016,2017,2016,2017,2016, 2016],
       'population': [2100, 2300, 1000, 700, 500, 500]}
pd.DataFrame(data)

        city  population  year
0    Beijing        2100  2016
1   Shanghai        2300  2017
2  Guangzhou        1000  2016
3   Shenzhen         700  2017
4   Hangzhou         500  2016
5  Chongqing         500  2016

#### columns的名字和顺序可以指定

In [40]:
pd.DataFrame(data, columns=['year', 'city', 'population', 'debt'])

   year       city  population debt
0  2016    Beijing        2100  NaN
1  2017   Shanghai        2300  NaN
2  2016  Guangzhou        1000  NaN
3  2017   Shenzhen         700  NaN
4  2016   Hangzhou         500  NaN
5  2016  Chongqing         500  NaN

#### 每一行的index可以自行创建

In [62]:
frame2 = pd.DataFrame(data, columns=['year', 'city', 'population', 'debt'],
            index = ['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year       city  population debt
one    2016    Beijing        2100  NaN
two    2017   Shanghai        2300  NaN
three  2016  Guangzhou        1000  NaN
four   2017   Shenzhen         700  NaN
five   2016   Hangzhou         500  NaN
six    2016  Chongqing         500  NaN

#### 两种表示列的方法,生成Series

In [47]:
frame2.city

one        Beijing
two       Shanghai
three    Guangzhou
four      Shenzhen
five      Hangzhou
six      Chongqing
Name: city, dtype: object

In [48]:
frame2['city']

one        Beijing
two       Shanghai
three    Guangzhou
four      Shenzhen
five      Hangzhou
six      Chongqing
Name: city, dtype: object

#### 表示每一行的两种方法，生成Series

In [50]:
frame2.ix['three']

year               2016
city          Guangzhou
population         1000
Name: three, dtype: object

In [52]:
frame2.ix[4]#绝对索引

year              2016
city          Hangzhou
population         500
Name: five, dtype: object

## DataFrame赋值

In [63]:
frame2['population']['one'] = 3000

C:\ProgramData\Anaconda3\envs\py3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [64]:
frame2

       year       city  population debt
one    2016    Beijing        3000  NaN
two    2017   Shanghai        2300  NaN
three  2016  Guangzhou        1000  NaN
four   2017   Shenzhen         700  NaN
five   2016   Hangzhou         500  NaN
six    2016  Chongqing         500  NaN

In [65]:
frame2.debt = 2000

In [66]:
frame2

       year       city  population  debt
one    2016    Beijing        3000  2000
two    2017   Shanghai        2300  2000
three  2016  Guangzhou        1000  2000
four   2017   Shenzhen         700  2000
five   2016   Hangzhou         500  2000
six    2016  Chongqing         500  2000

In [69]:
frame2 = pd.DataFrame(data, columns=['year', 'city', 'population', 'debt'],
            index = ['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year       city  population debt
one    2016    Beijing        2100  NaN
two    2017   Shanghai        2300  NaN
three  2016  Guangzhou        1000  NaN
four   2017   Shenzhen         700  NaN
five   2016   Hangzhou         500  NaN
six    2016  Chongqing         500  NaN

In [72]:
frame2.debt = np.arange(6)
frame2

       year       city  population  debt
one    2016    Beijing        2100     0
two    2017   Shanghai        2300     1
three  2016  Guangzhou        1000     2
four   2017   Shenzhen         700     3
five   2016   Hangzhou         500     4
six    2016  Chongqing         500     5

#### 还可以用Series来指定需要修改的index以及相对应的value，没有指定的默认用NaN.

In [76]:
val = pd.Series([100, 200, 300], index = ['two', 'three', 'five'])
frame2.debt = val
frame2

       year       city  population   debt
one    2016    Beijing        2100    NaN
two    2017   Shanghai        2300  100.0
three  2016  Guangzhou        1000  200.0
four   2017   Shenzhen         700    NaN
five   2016   Hangzhou         500  300.0
six    2016  Chongqing         500    NaN

In [77]:
frame2['western'] = (frame2.city == 'Chongqing')
print(frame2)

       year       city  population   debt  western
one    2016    Beijing        2100    NaN    False
two    2017   Shanghai        2300  100.0    False
three  2016  Guangzhou        1000  200.0    False
four   2017   Shenzhen         700    NaN    False
five   2016   Hangzhou         500  300.0    False
six    2016  Chongqing         500    NaN     True

In [78]:
frame2.columns

Index(['year', 'city', 'population', 'debt', 'western'], dtype='object')

In [79]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

#### index Object

#### DataFrame可以被转置

In [80]:
frame2.T

                one       two      three      four      five        six
year           2016      2017       2016      2017      2016       2016
city        Beijing  Shanghai  Guangzhou  Shenzhen  Hangzhou  Chongqing
population     2100      2300       1000       700       500        500
debt            NaN       100        200       NaN       300        NaN
western       False     False      False     False     False       True

In [81]:
pop = {'Beijing': {2016: 2100, 2017:2200},
      'Shanghai': {2015:2400, 2016:2500, 2017:2600}}
frame3 = pd.DataFrame(pop)
print(frame3)

      Beijing  Shanghai
2015      NaN      2400
2016   2100.0      2500
2017   2200.0      2600

In [82]:
print(frame3.T)

            2015    2016    2017
Beijing      NaN  2100.0  2200.0
Shanghai  2400.0  2500.0  2600.0

#### 指定index的顺序，以及切片化初始化数据

In [84]:
frame3.Beijing[1:3]

2016    2100.0
2017    2200.0
Name: Beijing, dtype: float64

In [85]:
pdata = {'Beijing': frame3['Beijing'][:-1], 'Shanghai':frame3['Shanghai'][:-1]}
print(pd.DataFrame(pdata))

      Beijing  Shanghai
2015      NaN      2400
2016   2100.0      2500

In [88]:
frame3.index.name = 'year'
frame3.columns.name = 'city'
frame3

city  Beijing  Shanghai
year
2015      NaN      2400
2016   2100.0      2500
2017   2200.0      2600

In [89]:
frame3.values

array([[   nan,  2400.],
       [ 2100.,  2500.],
       [ 2200.,  2600.]])

In [91]:
type(frame3.values)

numpy.ndarray

## index Object

In [92]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index
print(index)
print(index[1:])

Index(['a', 'b', 'c'], dtype='object')
Index(['b', 'c'], dtype='object')

#### index的值是不能被更改的，但是可以索引

In [93]:
index[0] = 1

TypeError: Index does not support mutable operations

In [99]:
index = pd.Index(np.arange(3))
index

Int64Index([0, 1, 2], dtype='int64')

In [103]:
obj2 = pd.Series([2,5,6], index)
print(obj2)
print(obj2.index is index)

0    2
1    5
2    6
dtype: int64
True

## 针对index进行索引和切片

In [108]:
obj = pd.Series(np.arange(4), index = ['a', 'b', 'c', 'd'])
obj[['a', 'd']]

a    0
d    3
dtype: int32

In [109]:
obj[[0, 2]]

a    0
c    2
dtype: int32

In [110]:
obj[1:3]

b    1
c    2
dtype: int32

In [111]:
obj['a':'c']

a    0
b    1
c    2
dtype: int32

#### 对DataFrame进行indexing

In [114]:
frame = pd.DataFrame(np.arange(9).reshape(3,3), 
                     index = ['a', 'b', 'c'],
                    columns = ['A', 'B', 'C'])
frame

   A  B  C
a  0  1  2
b  3  4  5
c  6  7  8

In [119]:
frame[:1]

   A  B  C
a  0  1  2

In [122]:
frame.ix['a':'c']

   A  B  C
a  0  1  2
b  3  4  5
c  6  7  8

In [117]:
frame['A':'B']

Empty DataFrame
Columns: [A, B, C]
Index: []

#### 既然不能直接取出列，怎么取出列(这里只要不是必须用列表表示的都不需要中括号）

In [141]:
frame.ix[:, 'A':'B']

   A  B
a  0  1
b  3  4
c  6  7

In [134]:
frame.ix[['a', 'c'], ['A','B']]

   A  B
a  0  1
c  6  7

In [137]:
frame.ix[:'c', ['A','C']]

   A  C
a  0  2
b  3  5
c  6  8

#### DataFrame可以用condition selections

In [126]:
frame[frame.A>1]

   A  B  C
b  3  4  5
c  6  7  8

## reindex

In [142]:
obj = pd.Series([4.5, 7.2, -5.3, 3.2], index=['d', 'b', 'a', 'c'])
print(obj)

d    4.5
b    7.2
a   -5.3
c    3.2
dtype: float64

In [144]:
obj.reindex(['a', 'b', 'c', 'd', 'e'])

a   -5.3
b    7.2
c    3.2
d    4.5
e    NaN
dtype: float64

In [145]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value = 0)

a   -5.3
b    7.2
c    3.2
d    4.5
e    0.0
dtype: float64

In [146]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index = [0,2,4])
print(obj3)

0      blue
2    purple
4    yellow
dtype: object

In [147]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [148]:
obj3.reindex(range(6), method='bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

#### 对DataFrame的reindex

In [149]:
frame = pd.DataFrame(np.arange(9).reshape(3,3), 
                    index = ['a', 'c', 'd'],
                    columns = ['Hangzhou', 'Shenzhen', 'Nanjing'])
print(frame)

   Hangzhou  Shenzhen  Nanjing
a         0         1        2
c         3         4        5
d         6         7        8

In [150]:
frame.reindex(['a', 'b', 'c', 'd'])

   Hangzhou  Shenzhen  Nanjing
a       0.0       1.0      2.0
b       NaN       NaN      NaN
c       3.0       4.0      5.0
d       6.0       7.0      8.0

In [154]:
frame.reindex(columns = ['Shenzhen', 'Tianjin','Hangzhou'], fill_value = 0)

   Shenzhen  Tianjin  Hangzhou
a         1        0         0
c         4        0         3
d         7        0         6

In [160]:
frame.reindex(index = ['a', 'b', 'c', 'd'],
             method = 'ffill')

   Hangzhou  Shenzhen  Nanjing
a         0         1        2
b         0         1        2
c         3         4        5
d         6         7        8

#### 利用drop删除index

In [161]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [163]:
obj4 = obj3.drop(2)
obj4

0      blue
4    yellow
dtype: object

In [164]:
obj3.drop([2,4])

0    blue
dtype: object

In [166]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [165]:
frame

   Hangzhou  Shenzhen  Nanjing
a         0         1        2
c         3         4        5
d         6         7        8

In [167]:
frame.drop('a')

   Hangzhou  Shenzhen  Nanjing
c         3         4        5
d         6         7        8

In [171]:
frame.drop(['Hangzhou', 'Shenzhen'], axis=1)

   Nanjing
a        2
c        5
d        8

## hierarchical index

In [172]:
data = pd.Series(np.random.randn(10), 
                 index=[['a','a','a','b','b','c','c','c','d','d'], \
                        [1,2,3,1,2,1,2,3,1,2]])
data

a  1    1.063206
   2   -1.443792
   3    1.449625
b  1    0.851905
   2    1.501853
c  1   -1.477715
   2    0.817936
   3    1.160507
d  1   -0.997735
   2    1.103571
dtype: float64

In [173]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 2, 3, 3], [0, 1, 2, 0, 1, 0, 1, 2, 0, 1]])

In [174]:
print(data.b)

1    0.851905
2    1.501853
dtype: float64

In [175]:
print(data['b':'d'])

b  1    0.851905
   2    1.501853
c  1   -1.477715
   2    0.817936
   3    1.160507
d  1   -0.997735
   2    1.103571
dtype: float64

In [176]:
print(data[1:3])

a  2   -1.443792
   3    1.449625
dtype: float64

## unstack和stack帮助我们在hierarchical index和DataFrame之间转换

In [177]:
data.unstack()

          1         2         3
a  1.063206 -1.443792  1.449625
b  0.851905  1.501853       NaN
c -1.477715  0.817936  1.160507
d -0.997735  1.103571       NaN

In [178]:
data.unstack().stack()

a  1    1.063206
   2   -1.443792
   3    1.449625
b  1    0.851905
   2    1.501853
c  1   -1.477715
   2    0.817936
   3    1.160507
d  1   -0.997735
   2    1.103571
dtype: float64

In [179]:
type(data.unstack().stack())

pandas.core.series.Series

#### DataFrame的hieraochical index

In [180]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                    index = [['a','a','b','b'], [1,2,1,2]],
                    columns = [['Beijing', 'Beijing', 'Shanghai'], ['apts', 'cars', 'apts']])
print(frame)

    Beijing      Shanghai
       apts cars     apts
a 1       0    1        2
  2       3    4        5
b 1       6    7        8
  2       9   10       11

In [184]:
frame.columns.names = ['alpha', 'number']
frame.index.names = ['cities', 'type']
print(frame)

alpha       Beijing      Shanghai
number         apts cars     apts
cities type
a      1          0    1        2
       2          3    4        5
b      1          6    7        8
       2          9   10       11

In [185]:
frame.ix['a', 1]

alpha     number
Beijing   apts      0
          cars      1
Shanghai  apts      2
Name: (a, 1), dtype: int32

In [187]:
frame.ix['a', 2]['Beijing', 'apts']

3

## 基础知识————————分割线

## 关于Merge，Join和Concatenate

In [189]:
df1 = pd.DataFrame({'apts': [55000, 60000],
                   'cars': [200000, 300000],},
                  index = ['Shanghai', 'Beijing'])
df1

           apts    cars
Shanghai  55000  200000
Beijing   60000  300000

In [190]:
df2 = pd.DataFrame({'apts': [25000, 20000],
                   'cars': [150000, 120000],},
                  index = ['Hangzhou', 'Najing'])
df3 = pd.DataFrame({'apts': [30000, 10000],
                   'cars': [180000, 100000],},
                  index = ['Guangzhou', 'Chongqing'])

In [191]:
[df1, df2, df3]

[           apts    cars
 Shanghai  55000  200000
 Beijing   60000  300000,            apts    cars
 Hangzhou  25000  150000
 Najing    20000  120000,             apts    cars
 Guangzhou  30000  180000
 Chongqing  10000  100000]

In [196]:
frames = [df1, df2, df3]
result1 = pd.concat(frames)
result1

            apts    cars
Shanghai   55000  200000
Beijing    60000  300000
Hangzhou   25000  150000
Najing     20000  120000
Guangzhou  30000  180000
Chongqing  10000  100000

#### concat的时候加上keys可以创建为hierarchical index

In [198]:
result2 = pd.concat(frames, keys = ['x', 'y', 'z'])
print(result2)

              apts    cars
x Shanghai   55000  200000
  Beijing    60000  300000
y Hangzhou   25000  150000
  Najing     20000  120000
z Guangzhou  30000  180000
  Chongqing  10000  100000

In [204]:
result2.ix['z', 'Chongqing']

apts     10000
cars    100000
Name: (z, Chongqing), dtype: int64

In [203]:
result2.ix[3:6]

              apts    cars
y Najing     20000  120000
z Guangzhou  30000  180000
  Chongqing  10000  100000

In [205]:
df4 = pd.DataFrame({'salaries': [10000, 30000, 30000, 20000, 15000]},
                  index = ['Suzhou', 'Beijing', 'Shanghai', 'Guangzhou', 'Tianjin'])
print(df4)

           salaries
Suzhou        10000
Beijing       30000
Shanghai      30000
Guangzhou     20000
Tianjin       15000

In [211]:
result3 = pd.concat([result1, df4], axis=1)
result3

              apts      cars  salaries
Beijing    60000.0  300000.0   30000.0
Chongqing  10000.0  100000.0       NaN
Guangzhou  30000.0  180000.0   20000.0
Hangzhou   25000.0  150000.0       NaN
Najing     20000.0  120000.0       NaN
Shanghai   55000.0  200000.0   30000.0
Suzhou         NaN       NaN   10000.0
Tianjin        NaN       NaN   15000.0

In [212]:
result3 = pd.concat([result1, df4], axis=1, join='inner')
result3

            apts    cars  salaries
Shanghai   55000  200000     30000
Beijing    60000  300000     30000
Guangzhou  30000  180000     20000

#### 用append来做concatenation

In [215]:
df1.append(df2)#默认上下连接

           apts    cars
Shanghai  55000  200000
Beijing   60000  300000
Hangzhou  25000  150000
Najing    20000  120000

In [216]:
df1.append(df4)

              apts      cars  salaries
Shanghai   55000.0  200000.0       NaN
Beijing    60000.0  300000.0       NaN
Suzhou         NaN       NaN   10000.0
Beijing        NaN       NaN   30000.0
Shanghai       NaN       NaN   30000.0
Guangzhou      NaN       NaN   20000.0
Tianjin        NaN       NaN   15000.0

#### Series和DataFrame一起concatenation，这时候Series可以被转换称DataFrame然后做join

In [218]:
s1 = pd.Series([60, 50], index=['Shanghai', 'Beijing'], name='meal')
print(s1)

Shanghai    60
Beijing     50
Name: meal, dtype: int64

In [219]:
df1

           apts    cars
Shanghai  55000  200000
Beijing   60000  300000

In [221]:
pd.concat([df1, s1], axis=1)

           apts    cars  meal
Shanghai  55000  200000    60
Beijing   60000  300000    50

#### append一个row到DataFrame中

In [222]:
s2 = pd.Series([18000, 120000], index=['apts', 'cars'], name='Xiamen')
s2

apts     18000
cars    120000
Name: Xiamen, dtype: int64

In [223]:
df1.append(s2)

           apts    cars
Shanghai  55000  200000
Beijing   60000  300000
Xiamen    18000  120000

In [227]:
pd.concat([df1, s2], axis=0)#都是不可以的

             apts      cars         0
Shanghai  55000.0  200000.0       NaN
Beijing   60000.0  300000.0       NaN
apts          NaN       NaN   18000.0
cars          NaN       NaN  120000.0

#### Merge（join）

In [228]:
df1 = pd.DataFrame({'apts': [55000, 60000, 58000],
                   'cars': [200000, 300000,250000],
                  'cities': ['Shanghai', 'Beijing','Shenzhen']})
print(df1)

    apts    cars    cities
0  55000  200000  Shanghai
1  60000  300000   Beijing
2  58000  250000  Shenzhen

In [229]:
df4 = pd.DataFrame({'salaries': [10000, 30000, 30000, 20000, 15000],
                  'cities': ['Suzhou', 'Beijing', 'Shanghai', 'Guangzhou', 'Tianjin']})
print(df4)

      cities  salaries
0     Suzhou     10000
1    Beijing     30000
2   Shanghai     30000
3  Guangzhou     20000
4    Tianjin     15000

In [231]:
result = pd.merge(df1, df4, on = 'cities')
result

    apts    cars    cities  salaries
0  55000  200000  Shanghai     30000
1  60000  300000   Beijing     30000

In [234]:
result2 = pd.merge(df1, df4, on = 'cities', how='outer')
result2

      apts      cars     cities  salaries
0  55000.0  200000.0   Shanghai   30000.0
1  60000.0  300000.0    Beijing   30000.0
2  58000.0  250000.0   Shenzhen       NaN
3      NaN       NaN     Suzhou   10000.0
4      NaN       NaN  Guangzhou   20000.0
5      NaN       NaN    Tianjin   15000.0

In [237]:
result3 = pd.merge(df1, df4, on = 'cities', how='left')
result3

    apts    cars    cities  salaries
0  55000  200000  Shanghai   30000.0
1  60000  300000   Beijing   30000.0
2  58000  250000  Shenzhen       NaN

#### join on index

In [238]:
df1 = pd.DataFrame({'apts': [55000, 60000, 58000],
                   'cars': [200000, 300000,250000]},
                  index=['Shanghai', 'Beijing','Shenzhen'])
print(df1)

           apts    cars
Shanghai  55000  200000
Beijing   60000  300000
Shenzhen  58000  250000

In [239]:
df4 = pd.DataFrame({'salaries': [10000, 30000, 30000, 20000, 15000]},
                  index=['Suzhou', 'Beijing', 'Shanghai', 'Guangzhou', 'Tianjin'])
print(df4)

           salaries
Suzhou        10000
Beijing       30000
Shanghai      30000
Guangzhou     20000
Tianjin       15000

In [240]:
df1.join(df4)

           apts    cars  salaries
Shanghai  55000  200000   30000.0
Beijing   60000  300000   30000.0
Shenzhen  58000  250000       NaN

In [244]:
df1.join(df4, how='outer')

              apts      cars  salaries
Beijing    60000.0  300000.0   30000.0
Guangzhou      NaN       NaN   20000.0
Shanghai   55000.0  200000.0   30000.0
Shenzhen   58000.0  250000.0       NaN
Suzhou         NaN       NaN   10000.0
Tianjin        NaN       NaN   15000.0

In [247]:
pd.merge(df1, df4, left_index=True, right_index=True)

           apts    cars  salaries
Shanghai  55000  200000     30000
Beijing   60000  300000     30000

In [249]:
pd.merge(df1, df4, left_index=True, right_index=True, how='outer')

              apts      cars  salaries
Beijing    60000.0  300000.0   30000.0
Guangzhou      NaN       NaN   20000.0
Shanghai   55000.0  200000.0   30000.0
Shenzhen   58000.0  250000.0       NaN
Suzhou         NaN       NaN   10000.0
Tianjin        NaN       NaN   15000.0

#### group by

In [252]:
import pandas as pd
salaries = pd.DataFrame({
    'Name': ['July', 'Chu', 'Chu', 'Lin', 'July', 'July', 'Chu', 'July'],
    'Year': [2016,2016,2016,2016,2017,2017,2017,2017],
    'Salary': [10000,2000,4000,5000,18000,25000,3000,4000],
    'Bonus': [3000,1000,1000,1200,4000,2300,500,1000]
})
print(salaries)

   Bonus  Name  Salary  Year
0   3000  July   10000  2016
1   1000   Chu    2000  2016
2   1000   Chu    4000  2016
3   1200   Lin    5000  2016
4   4000  July   18000  2017
5   2300  July   25000  2017
6    500   Chu    3000  2017
7   1000  July    4000  2017

In [253]:
group_by_name = salaries.groupby('Name')
group_by_name

In [255]:
group_by_name.aggregate(sum)

      Bonus  Salary  Year
Name
Chu    2500    9000  6049
July  10300   57000  8067
Lin    1200    5000  2016

In [257]:
group_by_name.sum()

      Bonus  Salary  Year
Name
Chu    2500    9000  6049
July  10300   57000  8067
Lin    1200    5000  2016

In [262]:
group_by_name_year = salaries.groupby(['Name', 'Year'])
group_by_name_year.sum()

           Bonus  Salary
Name Year
Chu  2016   2000    6000
     2017    500    3000
July 2016   3000   10000
     2017   7300   47000
Lin  2016   1200    5000

In [263]:
group_by_name_year.size()

Name  Year
Chu   2016    2
      2017    1
July  2016    1
      2017    3
Lin   2016    1
dtype: int64

In [270]:
group_by_name_year.max()

           Bonus  Salary
Name Year
Chu  2016   1000    4000
     2017    500    3000
July 2016   3000   10000
     2017   4000   25000
Lin  2016   1200    5000

In [271]:
group_by_name_year.describe()

          Bonus                                                           \
          count         mean         std     min     25%     50%     75%
Name Year
Chu  2016   2.0  1000.000000     0.00000  1000.0  1000.0  1000.0  1000.0
     2017   1.0   500.000000         NaN   500.0   500.0   500.0   500.0
July 2016   1.0  3000.000000         NaN  3000.0  3000.0  3000.0  3000.0
     2017   3.0  2433.333333  1504.43788  1000.0  1650.0  2300.0  3150.0
Lin  2016   1.0  1200.000000         NaN  1200.0  1200.0  1200.0  1200.0

                  Salary                                                \
              max  count          mean           std      min      25%
Name Year
Chu  2016  1000.0    2.0   3000.000000   1414.213562   2000.0   2500.0
     2017   500.0    1.0   3000.000000           NaN   3000.0   3000.0
July 2016  3000.0    1.0  10000.000000           NaN  10000.0  10000.0
     2017  4000.0    3.0  15666.666667  10692.676622   4000.0  11000.0
Lin  2016  1200.0    1.0   5000.000000           NaN   5000.0   5000.0


               50%      75%      max
Name Year
Chu  2016   3000.0   3500.0   4000.0
     2017   3000.0   3000.0   3000.0
July 2016  10000.0  10000.0  10000.0
     2017  18000.0  21500.0  25000.0
Lin  2016   5000.0   5000.0   5000.0

## 读写文件

#### read_csv

In [278]:
bikes = pd.read_csv('bikes.csv', encoding='latin1')

In [298]:
bikes = pd.read_csv('bikes.csv', encoding='latin1', sep=';', parse_dates=['Date'], 
                 dayfirst=True, index_col='Date')

In [299]:
bikes.head()

,Berri 1,Brébeuf (données non disponibles),Côte-Sainte-Catherine,Maisonneuve 1,Maisonneuve 2,du Parc,Pierre-Dupuy,Rachel1,St-Urbain (données non disponibles)
Date,,,,,,,,,
2012-01-01,35,NaN,0,38,51,26,10,16,NaN
2012-01-02,83,NaN,1,68,153,53,6,43,NaN
2012-01-03,135,NaN,2,104,248,89,3,58,NaN
2012-01-04,144,NaN,1,116,318,111,8,61,NaN
2012-01-05,197,NaN,2,124,330,97,13,95,NaN

In [300]:
bikes.dropna()

Empty DataFrame
Columns: [Berri 1, Brébeuf (données non disponibles), Côte-Sainte-Catherine, Maisonneuve 1, Maisonneuve 2, du Parc, Pierre-Dupuy, Rachel1, St-Urbain (données non disponibles)]
Index: []

In [302]:
bikes.dropna(how='all').head()#删除行全是na的

,Berri 1,Côte-Sainte-Catherine,Maisonneuve 1,Maisonneuve 2,du Parc,Pierre-Dupuy,Rachel1
Date,,,,,,,
2012-01-01,35,0,38,51,26,10,16
2012-01-02,83,1,68,153,53,6,43
2012-01-03,135,2,104,248,89,3,58
2012-01-04,144,1,116,318,111,8,61
2012-01-05,197,2,124,330,97,13,95

In [304]:
bikes.dropna(how='all', axis=1).head()

,Berri 1,Côte-Sainte-Catherine,Maisonneuve 1,Maisonneuve 2,du Parc,Pierre-Dupuy,Rachel1
Date,,,,,,,
2012-01-01,35,0,38,51,26,10,16
2012-01-02,83,1,68,153,53,6,43
2012-01-03,135,2,104,248,89,3,58
2012-01-04,144,1,116,318,111,8,61
2012-01-05,197,2,124,330,97,13,95

In [329]:
berri_bikes = bikes[['Berri 1']].copy()#这里的【‘Berri 1’】需要再加中括号，否则没有列
berri_bikes.head()

            Berri 1
Date
2012-01-01       35
2012-01-02       83
2012-01-03      135
2012-01-04      144
2012-01-05      197

In [330]:
berri_bikes.index

DatetimeIndex(['2012-01-01', '2012-01-02', '2012-01-03', '2012-01-04',
               '2012-01-05', '2012-01-06', '2012-01-07', '2012-01-08',
               '2012-01-09', '2012-01-10',
               ...
               '2012-10-27', '2012-10-28', '2012-10-29', '2012-10-30',
               '2012-10-31', '2012-11-01', '2012-11-02', '2012-11-03',
               '2012-11-04', '2012-11-05'],
              dtype='datetime64[ns]', name='Date', length=310, freq=None)

In [331]:
berri_bikes.index.weekday

Int64Index([6, 0, 1, 2, 3, 4, 5, 6, 0, 1,
            ...
            5, 6, 0, 1, 2, 3, 4, 5, 6, 0],
           dtype='int64', name='Date', length=310)

In [334]:
berri_bikes.ix[:, 'weekday'] = berri_bikes.index.weekday

In [335]:
berri_bikes.head()

            Berri 1  weekday
Date
2012-01-01       35        6
2012-01-02       83        0
2012-01-03      135        1
2012-01-04      144        2
2012-01-05      197        3

#### 每周每天汽车人数总和

In [337]:
week_day_counts = berri_bikes.groupby('weekday').aggregate(sum)
week_day_counts

         Berri 1
weekday
0         134298
1         135305
2         152972
3         160131
4         141771
5         101578
6          99310

In [338]:
bikes.head()

,Berri 1,Brébeuf (données non disponibles),Côte-Sainte-Catherine,Maisonneuve 1,Maisonneuve 2,du Parc,Pierre-Dupuy,Rachel1,St-Urbain (données non disponibles)
Date,,,,,,,,,
2012-01-01,35,NaN,0,38,51,26,10,16,NaN
2012-01-02,83,NaN,1,68,153,53,6,43,NaN
2012-01-03,135,NaN,2,104,248,89,3,58,NaN
2012-01-04,144,NaN,1,116,318,111,8,61,NaN
2012-01-05,197,NaN,2,124,330,97,13,95,NaN

In [340]:
bikes.dropna(axis=1, how='all').head()

,Berri 1,Côte-Sainte-Catherine,Maisonneuve 1,Maisonneuve 2,du Parc,Pierre-Dupuy,Rachel1
Date,,,,,,,
2012-01-01,35,0,38,51,26,10,16
2012-01-02,83,1,68,153,53,6,43
2012-01-03,135,2,104,248,89,3,58
2012-01-04,144,1,116,318,111,8,61
2012-01-05,197,2,124,330,97,13,95

In [346]:
bikes_sum = bikes.sum(axis=1).to_frame()
bikes_sum.head()

                0
Date
2012-01-01  176.0
2012-01-02  407.0
2012-01-03  639.0
2012-01-04  759.0
2012-01-05  858.0

In [347]:
bikes_sum.ix[:, 'weekday'] = bikes_sum.index.weekday
bikes_sum.head()

C:\ProgramData\Anaconda3\envs\py3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

                0  weekday
Date
2012-01-01  176.0        6
2012-01-02  407.0        0
2012-01-03  639.0        1
2012-01-04  759.0        2
2012-01-05  858.0        3

In [348]:
weekday_counts = bikes_sum.groupby('weekday').aggregate(sum)
weekday_counts.index = ['Monday', 'Tuesday', 
                        'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday']
weekday_counts

                  0
Monday     714963.0
Tuesday    698582.0
Wednesday  789722.0
Thursday   829069.0
Friday     738772.0
Saturday   516701.0
Sunday     518047.0